In [98]:
import db_init
from pony.orm import * 
import pandas as pd

In [99]:
def show_tables():
    query = 'Show tables;'        
    print(pd.read_sql(query, db_init.db.get_connection()))
    
@db_session
def count_tweets_time():
    query = 'SELECT created_at, count(*) FROM tweet group by created_at ;'        
    tweets_time = pd.read_sql(query, db_init.db.get_connection())
    return tweets_time
   

@db_session
def show_last_tweets(n):
    query = 'SELECT text_full, created_at FROM tweet order by created_at DESC limit '+str(n)+' ;'        
    last_posts = pd.read_sql(query, db_init.db.get_connection())
    return last_posts

@db_session
def show_last_replies(n): 
    query = 'SELECT text_full, created_at FROM tweet_reply order by created_at DESC limit '+str(n)+' ;'        
    last_replies = pd.read_sql(query, db_init.db.get_connection())
    return last_replies

@db_session
def count_tweets():
    query = 'SELECT count(*) FROM tweet ;'    
    count = pd.read_sql(query, db_init.db.get_connection())
    return count

@db_session
def count_replies():
    query = 'SELECT count(*) FROM tweet_reply ;'    
    count = pd.read_sql(query, db_init.db.get_connection())
    return count


@db_session
def count_tweet_reply_status():
    query = 'SELECT fetch_status,count(*) FROM tweet_reply group by fetch_status ;'    
    count = pd.read_sql(query, db_init.db.get_connection())
    return count
    
@db_session
def count_url_status():
    query = 'SELECT fetch_status,count(*) FROM url group by fetch_status ;'    
    count = pd.read_sql(query, db_init.db.get_connection())
    return count
    
    
    
## select status users do fetch group com status e count
## select status url do fetch group com status e count
## count de noticias

### Last 5 Tweets

In [100]:
show_last_tweets(5)

                                           text_full          created_at
0                            https://t.co/A6BaXsccHQ 2018-12-22 18:08:57
1  London killings hit 10-year high as man stabbe... 2018-12-22 18:07:56
2  Iran launches war games after US aircraft carr... 2018-12-22 18:07:53
3  LATEST: 13 hours into partial gov't shutdown. ... 2018-12-22 18:07:19
4  Dean Turner: Roller-coaster for sterling but t... 2018-12-22 18:07:02

### Last 5 Replies

In [101]:
show_last_replies(5)

                                           text_full          created_at
0  @CNN Baby its cold outside "rules"!! https://t... 2018-12-22 18:09:50
1                   @NBCNews https://t.co/O4GDTnmgdf 2018-12-22 18:09:47
2  @WSJ Syria has always been about a natural gas... 2018-12-22 18:09:47
3          @SkyNews He’s grotesque towards men, too. 2018-12-22 18:09:47
4  @USATODAY It feels more like "until the presid... 2018-12-22 18:09:46

### Count Tweets and Replies

In [102]:
count_tweets()

   count(*)
0      2452

In [103]:
count_replies()

   count(*)
0      5403

### User Timeline Fetch Status

In [104]:
count_tweet_reply_status()

       fetch_status  count(*)
0  ERRO - NO TWEETS         1
1                OK      1382
2          To Fetch      4020

### URL Fetch Status

In [105]:
count_url_status()

  fetch_status  count(*)
0        ERROR         1
1           OK       278